###############################################################################
# Created by write_sdc
###############################################################################
current_design Timer_PWM_Generator
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -add_delay [get_ports {reset}]
set_output_delay 2.0000 -add_delay [get_ports {PWM_OUTA}]
set_output_delay 2.0000 -add_delay [get_ports {PWM_OUTB}]
set_output_delay 2.0000 -add_delay [get_ports {timer_interrupt}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
